<?php
return [
    1001 => "Token已过期或者token无效",
    1002 => "当前用户组权限不够",

    2000 => "成功",

    3000 => "请求的banner不存在",
    3001 => "banner id必须传递",
    3002 => "banner id必须是数值类型",
    3003 => "banner id必须是正整数",

    4000 => "指定主题不存在，请检查主题ID",
    4001 => "ids必须传递",
    4002 => "ids格式错误，必须为正整数且以;分隔",
    4003 => "theme id必须传递",
    4004 => "theme id必须是数值类型",
    4005 => "theme id必须是正整数",

    5000 => "指定的产品不存在",
    5001 => "count必须是数值类型",
    5002 => "count必须是正整数",
    5003 => "count最大值为20",


    6000 => "指定类目不存在",
    6001 => "category id必须传递",
    6002 => "category id必须是数值类型",
    6003 => "category id必须是正整数",

    7001 => "name参数必须",
    7002 => "name参数不能为空",
    7003 => "mobile参数必须",
    7004 => "mobile参数必须为手机号码",
    7005 => "province参数必须",
    7006 => "province参数不能为空",
    7007 => "city参数必须",
    7008 => "city参数不能为空",
    7009 => "country参数必须",
    7010 => "country参数不能为空",
    7011 => "detail参数必须",
    7012 => "detail参数不能为空",

    8000 => "products参数必须存在",
    8001 => "商品列表不能为空",
    8002 => "商品参数不正确",
    8003 => "商品列表参数错误",

    8500 => "订单错误",
    8600 => "用户收货地址不存在，订单生产失败",

    9000 => "code必须传递",
    9001 => "code不能为空",
    9002 => "微信接口调用失败",

    9100 => "用户不存在",

    9998 => "参数验证错误",

    9999 => "服务器内部错误"
];


