<?php
return [
    1001 =>"Token已过期或者token无效",
    2000 => "成功",

    3000 => "请求的banner不存在",
    3001 => "banner id必须传递",
    3002 => "banner id必须是数值类型",
    3003 => "banner id必须是正整数",

    4000 => "指定主题不存在，请检查主题ID",
    4001 => "ids必须传递",
    4002 => "ids格式错误，必须为正整数且以;分隔",
    4003 => "theme id必须传递",
    4004 => "theme id必须是数值类型",
    4005 => "theme id必须是正整数",

    5000 => "指定的产品不存在",
    5001 => "count必须是数值类型",
    5002 => "count必须是正整数",
    5003 => "count最大值为20",


    6000 => "指定类目不存在",
    6001 => "category id必须传递",
    6002 => "category id必须是数值类型",
    6003 => "category id必须是正整数",

    9000 => "code必须传递",
    9001 => "code不能为空",
    9002 => "微信接口调用失败",

    9998 => "参数验证错误",

    9999 => "服务器内部错误"
];


